#include "scene_dialog.h"

//===================================================================================================================================================
//	Подключение стандартных библиотек
//===================================================================================================================================================

//===================================================================================================================================================
//	Подключение сторонних библиотек
//===================================================================================================================================================

//===================================================================================================================================================
//	Подключение библиотек QT
//===================================================================================================================================================
#include <QLabel>
#include <QPushButton>
#include <QHBoxLayout>
#include <QVBoxLayout>


//===================================================================================================================================================
//	Подключение модулей проекта
//===================================================================================================================================================

//===================================================================================================================================================
//	Конструктор и деструктор класса
//===================================================================================================================================================
SceneDialog::SceneDialog(QString name, QWidget* parent) : QDialog(parent)
{
	//	Свойства класса
	_name = name;

	//	Формирование вида окна диалога
	this->setWindowFlags(this->windowFlags() & ~Qt::WindowContextHelpButtonHint);
	this->setWindowTitle(QString("Название алгоритма"));

	//	Создание полей редактирования
	_name_edit = new QLineEdit(this);
	_name_edit->setMaximumWidth(250);
	_name_edit->setText(_name);
	QHBoxLayout* edit_layout = new QHBoxLayout();
	edit_layout->addWidget(new QLabel("Алгоритм:"));
	edit_layout->addWidget(_name_edit);

	//	Создание кнопок
	QPushButton* ok_button = new QPushButton(QString("OK"));
	ok_button->setDefault(true);
	ok_button->setMinimumSize(80, 24);
	QPushButton* exit_button = new QPushButton(QString("Отмена"));
	exit_button->setMinimumSize(80, 24);

	QHBoxLayout* button_layout = new QHBoxLayout();
	button_layout->addStretch();
	button_layout->addWidget(exit_button);
	button_layout->addWidget(ok_button);

	//	Вывод основной формы
	QVBoxLayout* main_layout = new QVBoxLayout(this);
	main_layout->addLayout(edit_layout);
	main_layout->addStretch();
	main_layout->addLayout(button_layout);
	this->setMinimumSize(350, 100);
	this->setMaximumSize(350, 100);

	//	Обработка сигналов
	connect(exit_button, &QPushButton::clicked, this, &SceneDialog::reject);
	connect(ok_button, &QPushButton::clicked, this, &SceneDialog::OkClicked);
}

SceneDialog::~SceneDialog()
{
}


//===================================================================================================================================================
//	Обработка сигналов формы
//===================================================================================================================================================
void SceneDialog::OkClicked()
{
	_name = _name_edit->text();
	this->accept();
}
