#ifndef __EDITOR_LINK_H__
#define __EDITOR_LINK_H__


//===================================================================================================================================================
//	Подключение стандартных библиотек
//===================================================================================================================================================

//===================================================================================================================================================
//	Подключение сторонних библиотек
//===================================================================================================================================================

//===================================================================================================================================================
//	Подключение библиотек QT
//===================================================================================================================================================
#include <QGraphicsObject>
#include <QGraphicsItem>
#include <QWidget>
#include <QString>
#include <QMenu>
#include <QPainterPath>
#include <QList>
#include <QPointF>
#include <QPainter>
#include <QStyleOptionGraphicsItem>
#include <QGraphicsSceneMouseEvent>

//===================================================================================================================================================
//	Подключение модулей проекта
//===================================================================================================================================================
#include <gui/forms/algorithms/custom/Editor/editor_link_data.h>
#include <gui/forms/algorithms/custom/Editor/graphic_path.h>


//===================================================================================================================================================
//	Описание класса
//===================================================================================================================================================
class EditorLink : public QGraphicsObject, public EditorLinkData
{
	Q_OBJECT

public:
	//===============================================================================================================================================
	//	Конструктор и деструктор класса
	//===============================================================================================================================================
	EditorLink(QList<QPointF> points = QList<QPointF>(), QString ID = QString(), QGraphicsItem* parent = nullptr);
	~EditorLink();

	//===============================================================================================================================================
	//	Методы работы со свойствами класса
	//===============================================================================================================================================
	QList<QPointF> points() { return _graphic_path->points(); }
	void needUpdate() { _need_update = true; update(); }
	QPointF firstPoint() { return scenePos() + points().first(); }
	QPointF lastPoint() { return scenePos() + points().last(); }
	GraphicPath* graphicPath() { return _graphic_path; }
	bool isMoving() const { return _is_moving; }
	void setMoving(bool flag) { _is_moving = flag; }
	int selectedLine() const { return _selected_line; }
	void setPoints(const QList<QPointF> points);
	void changeSource(QPointF point);
	void changeTarget(QPointF point);

private:
	//===============================================================================================================================================
	//	Вспомогательные методы класса
	//===============================================================================================================================================
	QPainterPath path();
	void updatePath();
	void paintSelected(QPainter* painter);

protected:
	//===============================================================================================================================================
	//	Виртуальные методы класса
	//===============================================================================================================================================
	virtual QRectF boundingRect() const override;
	virtual QPainterPath shape() const override;
	virtual void paint(QPainter* painter, const QStyleOptionGraphicsItem* option, QWidget* widget) override;

	//===============================================================================================================================================
	//	Обработка сигналов мышки
	//===============================================================================================================================================
	virtual void mousePressEvent(QGraphicsSceneMouseEvent* event);
	virtual void mouseReleaseEvent(QGraphicsSceneMouseEvent* event);
	virtual void mouseMoveEvent(QGraphicsSceneMouseEvent* event);

private slots:
	//===============================================================================================================================================
	//	Обработка сигналов меню
	//===============================================================================================================================================
	void addNode();
	void removeNodes();

private:
	//===============================================================================================================================================
	//	Свойства класса
	//===============================================================================================================================================
	QMenu* _menu;
	GraphicPath* _graphic_path;
	QPainterPath _path;
	QPointF _menu_point;
	bool _is_moving;
	bool _need_update;
	int _selected_line;
};


#endif	//	__EDITOR_LINK_H__
