#pragma once

//===================================================================================================================================================
//	Подключение библиотек QT
//===================================================================================================================================================
#include <QScrollArea>
#include <QTabWidget>
#include <QAbstractListModel>
#include <QListView>
#include <QTreeWidget>

//===================================================================================================================================================
//	Подключение модулей проекта
//===================================================================================================================================================
#include <gui/forms/DcFormFactory.h>
#include <gui/forms/algorithms/embedded/IAlgorithm.h>


//===================================================================================================================================================
//	Описание класса
//===================================================================================================================================================
class DcEmbeddedAlgorithmsForm : public DcForm
{
	Q_OBJECT

public:
    DcEmbeddedAlgorithmsForm(DcController* controller);
	~DcEmbeddedAlgorithmsForm();

	static bool isAvailableFor(DcController *controller);
	static void fillReport(DcIConfigReport *report);

private:
	//===============================================================================================================================================
	//	Вспомогательные методы класса
	//===============================================================================================================================================
	void DrawAutomatic(IAlgorithm* algorithm, QTabWidget* automatic);
	void DrawProtectTree(DcController* controller);
	void DrawProtectTab(IAlgorithm* algorithm);

private slots:
	//===============================================================================================================================================
	//	Методы обработки изменений
	//===============================================================================================================================================
	void TreeClicked(QTreeWidgetItem* item, int column);

protected:
	//===============================================================================================================================================
	//	Свойства класса
	//===============================================================================================================================================
	QTreeWidget* _protect_tree;
	QTabWidget* _protect_tab;

};

REGISTER_FORM(DcEmbeddedAlgorithmsForm, DcMenu::algorithms_embedded)
