#include <gui/forms/algorithms/custom/Nodes/xor_node.h>

//===================================================================================================================================================
//	Подключение стандартных библиотек
//===================================================================================================================================================

//===================================================================================================================================================
//	Подключение сторонних библиотек
//===================================================================================================================================================

//===================================================================================================================================================
//	Подключение библиотек QT
//===================================================================================================================================================
#include <QPainterPath>
#include <QPainter>

//===================================================================================================================================================
//	Подключение модулей проекта
//===================================================================================================================================================
#include <gui/forms/algorithms/custom/flexlogic_namespace.h>

//===================================================================================================================================================
//	Конструктор и деструктор класса
//===================================================================================================================================================
Xor::Xor(QString ID, QSizeF node_size, QGraphicsItem* parent) : EditorNode(ID, parent)
{
    //  Настройка параметров
    SetType("Xor");
    SetNodeType(FlexLogic::RZA_XOR);
    node_size == QSizeF() ? SetNodeSize(QSizeF(60, 90)) : SetNodeSize(node_size);
    SetOutput(true);
    SetInversion(true);
    InitInputs(2, 16);
    InitSockets();
}

Xor::~Xor()
{
}


//===================================================================================================================================================
//	Вспомогательные методы класса
//===================================================================================================================================================
void Xor::paintElement(QPainter* painter)
{
    QRectF rectangle = AvailableRect();
    QPainterPath path;
    path.addRoundedRect(rectangle, 5, 5);

    //  Вывод и заливка контура элемента
    painter->save();
    painter->setPen(QPen(FlexLogic::shape_color, 2, Qt::SolidLine, Qt::RoundCap, Qt::RoundJoin));
    painter->setRenderHint(QPainter::Antialiasing);
    painter->fillPath(path, FlexLogic::shape_bkcolor);
    painter->drawPath(path);

    //  Вывод текста преобразования
    int text_bottom = 30;
    QRectF textRect(rectangle.topLeft(), QPointF(rectangle.right(), text_bottom));
    painter->setFont(FlexLogic::LABEL_TEXT_FONT);
    painter->drawText(textRect, Qt::AlignCenter, "XOR");
    painter->drawLine(rectangle.left(), text_bottom, rectangle.right(), text_bottom);
    painter->restore();

    return;
}
