#ifndef __BINDINGS_FORM_H__
#define __BINDINGS_FORM_H__


//===================================================================================================================================================
//	Подключение библиотек QT
//===================================================================================================================================================
#include <QObject>
#include <QStandardItemModel>
#include <QStandardItem>
#include <QModelIndex>
#include <QTreeView>

//===================================================================================================================================================
//	Подключение модулей проекта
//===================================================================================================================================================
#include "gui/forms/DcFormFactory.h"
#include "data_model/dc_controller.h"
#include "service_manager/service_manager.h"


//===================================================================================================================================================
//	Описание класса
//===================================================================================================================================================
class BindingForm : public DcForm
{
    Q_OBJECT

public:
	//===============================================================================================================================================
	//	Конструктор и деструктор класса
	//===============================================================================================================================================
    BindingForm(DcController *controller);
    ~BindingForm();

    //	Правило пяти
    BindingForm(const BindingForm& other) = delete;
    BindingForm(BindingForm&& other) = delete;
    BindingForm& operator=(const BindingForm& other) = delete;
    BindingForm& operator=(BindingForm&& other) = delete;

	//===============================================================================================================================================
	//	Обязательные методы класса
	//===============================================================================================================================================
	static bool isAvailableFor(DcController *controller);
	static void fillReport(DcIConfigReport *report);

private slots:
    //===============================================================================================================================================
    //	Методы обработки сигналов делегатов
    //===============================================================================================================================================
    void onAlgClicked(const QModelIndex& index);
    void onOutputClicked(const QModelIndex& index);


private:
	//===============================================================================================================================================
	//	Вспомогательные методы класса
	//===============================================================================================================================================
    DcController* controller() { return _controller; }
    bool getAlgModel(QStandardItemModel* model);
    bool getOutputModel(QStandardItemModel* model);
    bool isUsedInCfc(VirtualInputSignal *vdin) const;

	//===============================================================================================================================================
	//	Свойства класса
	//===============================================================================================================================================
	DcController* _controller;
    QStandardItemModel* _alg_model;
    QStandardItemModel* _output_model;
    QTreeView* _alg_tree;
};

REGISTER_FORM(BindingForm, DcMenu::matrix);

#endif	//	__BINDINGS_FORM_H__
