#ifndef __CFC_SCENE_H__
#define __CFC_SCENE_H__


//===================================================================================================================================================
//	Подключение библиотек QT
//===================================================================================================================================================
#include <QObject>
#include <QString>
#include <QGraphicsSceneDragDropEvent>
#include <QGraphicsSceneMouseEvent>
#include <QGraphicsSceneContextMenuEvent>
#include <QAction>
#include <QMenu>
#include <QPointF>

//===================================================================================================================================================
//	Подключение модулей проекта
//===================================================================================================================================================
#include "service_manager/service_manager.h"
#include "service_manager/services/alg_cfc/cfc_alg_service.h"
#include "cfc_basic_scene.h"
#include "gui/forms/algorithms/custom/cfc_editor/cfc_new_link.h"


//===================================================================================================================================================
//	Описание класса
//===================================================================================================================================================
//	Класс грвфической сцены
//  Методы работы с графикой и с сигналами управления
//  id - id алгоритма гибкой логики
//===================================================================================================================================================
class CfcScene : public CfcBasicScene
{
    Q_OBJECT

public:
    //===============================================================================================================================================
    //	Конструктор класса
    //===============================================================================================================================================
    CfcScene(CfcAlgService* service, ServiceManager* service_manager, QGraphicsScene* parent = nullptr);

    //===============================================================================================================================================
    //	Открытые методы класса
    //===============================================================================================================================================
    bool gridEnabled() const { return _grid_enable; }
    void setGrid(bool flag) { _grid_enable = flag; }
    QMenu* contextMenu() { return _context_menu; }
    void setContextMenu(QMenu* menu) { _context_menu = menu; }

public slots:
    //===============================================================================================================================================
    //	Методы обработки сигналов меню
    //===============================================================================================================================================
    void onActionBI();
    void onActionBO();
    void onActionParam();

protected:
    //===============================================================================================================================================
    //	Перегружаемые методы класса
    //===============================================================================================================================================
    virtual void drawBackground(QPainter* painter, const QRectF& rect) override;
    virtual void dropEvent(QGraphicsSceneDragDropEvent* event) override;
    virtual void dragEnterEvent(QGraphicsSceneDragDropEvent* event) override;
    virtual void dragMoveEvent(QGraphicsSceneDragDropEvent* event) override;
    virtual void mousePressEvent(QGraphicsSceneMouseEvent* event) override;
    virtual void mouseMoveEvent(QGraphicsSceneMouseEvent* event) override;
    virtual void mouseReleaseEvent(QGraphicsSceneMouseEvent* event) override;
    virtual void contextMenuEvent(QGraphicsSceneContextMenuEvent *event) override;

private:
    //===============================================================================================================================================
    //	Свойства класса
    //===============================================================================================================================================
    bool _grid_enable;                          //  Флаг активации сетки
    CfcNewLink* _new_link;                      //  Объект для создания новой связи
    QAction* _action_bi;                        //  Вызов смены сигнала дискретного входа
    QAction* _action_bo;                        //  Вызов смены сигнала дискретного выхода
    QAction* _action_param;                     //  Вызов смены параметров элемента
    QMenu* _context_menu;                       //  Контекстное меню сцены
};

#endif // __CFC_BASIC_SCENE_H__
