#ifndef __CFC_SOCKET_H__
#define __CFC_SOCKET_H__


//===================================================================================================================================================
//	Подключение библиотек QT
//===================================================================================================================================================
#include <QGraphicsObject>
#include <QGraphicsItem>
#include <QString>
#include <QRectF>
#include <QDomNode>
#include <QList>

//===================================================================================================================================================
//	Подключение модулей проекта
//===================================================================================================================================================
class CfcBasicNode;
class CfcLink;


//===================================================================================================================================================
//	Описание класса
//===================================================================================================================================================
//	Базовый класс для входных и выходных сокетов для всех элементов гибкой логики.
//  Обработка внешних событий (мышка)
//===================================================================================================================================================
class CfcSocket : public QGraphicsObject
{
public:
    //===============================================================================================================================================
    //	Списки данных
    //===============================================================================================================================================
    enum SocketType : uint8_t { INPUT_SOCKET = 0, OUTPUT_SOCKET };

    //===============================================================================================================================================
    //	Конструктор класса
	//===============================================================================================================================================
    CfcSocket(uint8_t index, CfcBasicNode* node, QGraphicsItem* parent = nullptr);

	//===============================================================================================================================================
	//	Открытые методы класса
	//===============================================================================================================================================
    QString id() const { return _id; }
    uint16_t index() const { return _index; }
    uint8_t selectShape() const { return _select_shape; }
    bool highLight() const { return _highlight; }
    CfcBasicNode* parent() { return _parent; }
    QList<CfcLink*> links() {return _links; }
    void appendLink(CfcLink* link);
    void removeLink(CfcLink* link);

    //===============================================================================================================================================
    //	Виртуальные методы класса
    //===============================================================================================================================================
    virtual uint8_t socketType() const = 0;
    virtual QDomNode toXML() const = 0;

    //===============================================================================================================================================
	//	Перегружаемые методы класса
    //===============================================================================================================================================
    virtual void hoverEnterEvent(QGraphicsSceneHoverEvent* event) override;
	virtual void hoverLeaveEvent(QGraphicsSceneHoverEvent* event) override;
    virtual QRectF boundingRect() const override;

private:
	//===============================================================================================================================================
	//	Свойства класса
	//===============================================================================================================================================
    static inline uint16_t _counter { 1 };      //  Счетчик для формирования идентификатора сокета
    QString _id;                                //	Уникальный идентификатор сокета (QString для обратной совместимости)
    uint8_t _index;                             //  Индекс сокета в списке сокетов одного элемента
    bool _highlight;                            //	Признак выделения сокета (для визуализации при наведении мыши)
    uint8_t _select_shape = 10;                 //  Размер области сокета
    CfcBasicNode* _parent;                      //  Класс узла, котороиу принадлежит сокет
    QList<CfcLink*> _links;                     //  Список соединений на выходе из элемента
};


#endif	//	__CFC_SOCKET_H__
