#ifndef __CFC_NEW_LINK_H__
#define __CFC_NEW_LINK_H__


//===================================================================================================================================================
//	Подключение библиотек QT
//===================================================================================================================================================
#include <QGraphicsObject>
#include <QGraphicsItem>
#include <QWidget>
#include <QPointF>
#include <QList>
#include <QPainterPath>
#include <QPainter>
#include <QStyleOptionGraphicsItem>
#include <QPolygonF>
#include <QRectF>
#include <QGraphicsSceneMouseEvent>

//===================================================================================================================================================
//	Подключение модулей проекта
//===================================================================================================================================================
#include "gui/forms/algorithms/custom/cfc_editor/cfc_socket.h"


//===================================================================================================================================================
//	Описание класса
//===================================================================================================================================================
//  Класс отображения набора линий, который будет конвертирован в новое соединение
//===================================================================================================================================================
class CfcNewLink : public QGraphicsObject
{
	Q_OBJECT

public:
	//===============================================================================================================================================
	//	Конструктор и деструктор класса
	//===============================================================================================================================================
    CfcNewLink(CfcSocket* socket, QGraphicsItem* parent = nullptr);

	//===============================================================================================================================================
	//	Открытые методы класса
	//===============================================================================================================================================
    CfcSocket* currentSocket() const {return _current_socket;}
    CfcSocket* source() const {return _source_socket;}
    CfcSocket* target() const {return _target_socket;}
    QList<QPointF> points() const;

    //===============================================================================================================================================
    //	Перегружаемые методы класса
    //===============================================================================================================================================
    virtual void paint(QPainter* painter, const QStyleOptionGraphicsItem* option, QWidget* widget = nullptr) override;
    virtual QRectF boundingRect() const override;
    virtual QPainterPath shape() const override;
    virtual void mousePressEvent(QGraphicsSceneMouseEvent* event) override;
    virtual void mouseReleaseEvent(QGraphicsSceneMouseEvent* event) override;
    virtual void mouseMoveEvent(QGraphicsSceneMouseEvent* event) override;

private:
    //===============================================================================================================================================
    //	Вспомогательные методы класса
    //===============================================================================================================================================
    QPointF firstPoint() const { return _current_socket->scenePos(); }
    QPolygonF polygon() const;
    QPainterPath path() const;

    //  Проверка валидности финального сокета при создании связи
    //  Проверка на соответствие входа/выхода и на наличие связей
    //  При валидности сокета возвращает true, в противном случае - false
    bool checkSocket(CfcSocket* socket) const;

    //===============================================================================================================================================
    //	Свойства класса
    //===============================================================================================================================================
    CfcSocket* _current_socket;
    CfcSocket* _source_socket;
    CfcSocket* _target_socket;
    QPointF _mouse_point;
};

#endif	//	__CFC_NEW_LINK_H__
