#ifndef __CFC_LINK_H__
#define __CFC_LINK_H__


//===================================================================================================================================================
//	Подключение библиотек QT
//===================================================================================================================================================
#include <QObject>
#include <QString>
#include <QList>
#include <QDomNode>
#include <QPainter>
#include <QPainterPath>
#include <QMenu>
#include <QPointF>
#include <QGraphicsSceneMouseEvent>

//===================================================================================================================================================
//	Подключение модулей проекта
//===================================================================================================================================================
#include "cfc_basic_link.h"
#include "gui/forms/algorithms/custom/cfc_editor/cfc_line.h"


//===================================================================================================================================================
//	Описание класса
//===================================================================================================================================================
//	Класс соединения между элементами гибкой логики
//  Обработка внешних событий (мышка)
//===================================================================================================================================================
class CfcLink : public CfcBasicLink
{
	Q_OBJECT

public:
	//===============================================================================================================================================
    //	Конструкторы класса
	//===============================================================================================================================================
    CfcLink(QString id = QString(), QList<QPointF> points = QList<QPointF>());
    CfcLink(QDomNode xml);

	//===============================================================================================================================================
    //	Открытые методы класса
	//===============================================================================================================================================
    void needUpdate();
    void move();

    //===============================================================================================================================================
    //	Перегружаемые методы класса
    //===============================================================================================================================================
    virtual QRectF boundingRect() const override;
    virtual QPainterPath shape() const override;
    virtual void paint(QPainter* painter, const QStyleOptionGraphicsItem* option, QWidget* widget) override;
    virtual void mousePressEvent(QGraphicsSceneMouseEvent* event) override;
    virtual void mouseReleaseEvent(QGraphicsSceneMouseEvent* event) override;
    virtual void mouseMoveEvent(QGraphicsSceneMouseEvent* event) override;


private slots:
	//===============================================================================================================================================
	//	Обработка сигналов меню
	//===============================================================================================================================================
    void linkAddNode();
    void removeNodes();

private:
    //===============================================================================================================================================
    //	Вспомогательные методы класса
    //===============================================================================================================================================
    QPainterPath path();
    void paintSelected(QPainter* painter);
    bool less(const QPointF& p1, const QPointF& p2) const;
    void sortOnLine(CfcLine& line, QList<QPointF>& list);

    //===============================================================================================================================================
	//	Свойства класса
	//===============================================================================================================================================
    bool _is_moving;                        //  Признак перемещения связи
    bool _need_update;                      //  Флаг обновления изображения
    QMenu _menu;                            //  Контекстное меню
    QPointF _menu_point;                    //  Точка вызова контекстного меню
    QPainterPath _path;                     //  Набор точек для вывода соединения
    CfcLine* _sorting_line;                 //  Линия для сортировки
};


#endif	//	__CFC_LINK_H__
