#ifndef __CFC_BASIC_LINK_H__
#define __CFC_BASIC_LINK_H__


//===================================================================================================================================================
//	Подключение библиотек QT
//===================================================================================================================================================
#include <QGraphicsObject>
#include <QGraphicsItem>
#include <QString>
#include <QDomNode>
#include <QPointF>
#include <QList>
#include <QPolygonF>

//===================================================================================================================================================
//	Подключение модулей проекта
//===================================================================================================================================================
#include "gui/forms/algorithms/custom/cfc_editor/cfc_line.h"
#include "gui/forms/algorithms/custom/cfc_editor/cfc_basic_node.h"
#include "gui/forms/algorithms/custom/cfc_editor/cfc_socket.h"


//===================================================================================================================================================
//	Описание класса
//===================================================================================================================================================
//	Базовый класс для соединений между элементами гибкой логики
//  Методы работы со свойствами класса
//===================================================================================================================================================
class CfcBasicLink : public QGraphicsObject
{
public:
	//===============================================================================================================================================
    //	Конструкторы класса
	//===============================================================================================================================================
    CfcBasicLink(QString id = QString(), QList<QPointF> points = QList<QPointF>(), QGraphicsItem* parent = nullptr);
    CfcBasicLink(QDomNode xml, QGraphicsItem* parent = nullptr);

    //===============================================================================================================================================
    //	Открытые методы класса
	//===============================================================================================================================================
    QString id() const { return _id; }
    CfcSocket* source() const { return _source;}
    QString sourceID() const { return _source  && _source->parent() ? _source->parent()->id() : _source_id; }
    int sourceIndex() const { return _source ? _source->index() : _source_index; }
    CfcSocket* target() const { return _target; }
    QString targetID() const { return _target && _target->parent() ? _target->parent()->id() : _target_id; }
    int targetIndex() const { return _target ? _target->index() : _target_index; }
    QList<QPointF> points() const { return _points; };
    void setPoints(const QList<QPointF>& points) { _points = points;};
    void setSource(CfcSocket* source);
    void setTarget(CfcSocket* target);
    QList<CfcLine> lines() const;
    void normalize();
    bool addNode(const QPointF& node);
    int selectedLine(const QPointF& point);
    bool moveLine(int line, const QPointF& point);
    QPolygonF polygon() const;

    //===============================================================================================================================================
    //	Сериализация элемента
    //===============================================================================================================================================
    QDomNode toXML() const;

private:
    //===============================================================================================================================================
    //	Вспомогательные методы класса
    //===============================================================================================================================================
    bool isOnLine(const QPointF& begin, const QPointF& end, const QPointF& node);
    void arrangePoints(QList<QPointF> old_points);

    //===============================================================================================================================================
    //	Свойства класса
    //===============================================================================================================================================
    static inline int _counter { 1 };       //  Счетчик для формирования идентификатора соединения
    QString _id;                            //	Уникальный идентификатор соединения (QString для обратной совместимости)
    CfcSocket* _source;                     //  Сокет из которого начинается соединение
    CfcSocket* _target;                     //  Сокет в который приходит соединение
    QString _source_id;                     //  ID источника для работы с XML
    int _source_index;                      //  Индекс сокета источника для работы с XML
    QString _target_id;                     //  ID цели для работы с XML
    int _target_index;                      //  Индекс сокета цели для работы с XML
    QList<QPointF> _points;                 //  Список точек соединения;
};


#endif	//	__CFC_BASIC_LINK_H__
