#ifndef __CFC_NODE_H__
#define __CFC_NODE_H__


//===================================================================================================================================================
//	Подключение библиотек QT
//===================================================================================================================================================
#include <QString>
#include <QDomNode>
#include <QGraphicsItem>
#include <QPainter>
#include <QStyleOptionGraphicsItem>
#include <QWidget>
#include <QGraphicsSceneMouseEvent>
#include <QMenu>
#include <QVariant>

//===================================================================================================================================================
//	Подключение модулей проекта
//===================================================================================================================================================
#include "cfc_basic_node.h"


//===================================================================================================================================================
//	Описание класса
//===================================================================================================================================================
//	Вспомогательный класс для всех элементов гибкой логики
//  Вывод графики
//  Обработка внешних событий (мышка)
//===================================================================================================================================================
class CfcNode : public CfcBasicNode
{
public:
    //===============================================================================================================================================
    //	Конструкторы класса
    //===============================================================================================================================================
    CfcNode(QString id = QString(), QGraphicsItem* parent = nullptr);
    CfcNode(QDomNode xml, QGraphicsItem* parent = nullptr);

    //===============================================================================================================================================
    //	Открытые методы класса
    //===============================================================================================================================================
    void editNode();

    //===============================================================================================================================================
    //	Перегружаемые методы класса
    //===============================================================================================================================================
    QRectF availableRect() const { return QRectF(QPointF(0, 0), size()); }
    virtual void paintElement(QPainter* painter) = 0;
    virtual void paint(QPainter* painter, const QStyleOptionGraphicsItem* option, QWidget* widget)  override;
    virtual QRectF boundingRect() const override;
    virtual void mousePressEvent(QGraphicsSceneMouseEvent* event) override;
    virtual void mouseReleaseEvent(QGraphicsSceneMouseEvent* event) override;
    virtual QVariant itemChange(GraphicsItemChange change, const QVariant &value) override;

private:
    //===============================================================================================================================================
    //	Вспомогательные методы класса
    //===============================================================================================================================================
    void paintSelected(QPainter* painter);
};

#endif // __CFC_NODE_H__
