#include "cfc_input_socket.h"


//===================================================================================================================================================
//	Подключение библиотек QT
//===================================================================================================================================================
#include <QColor>
#include <QPen>
#include <QBrush>
#include <QDomElement>
#include <QDomDocument>

//===================================================================================================================================================
//	Подключение модулей проекта
//===================================================================================================================================================


//===================================================================================================================================================
//	список переменных
//===================================================================================================================================================
namespace {
    int shape_width = 2;
    int socket_radius = 3;
    QColor shape_color = QColor(70, 100, 120);
    QColor input_bkcolor = QColor(Qt::cyan);
    QColor socket_select_color = QColor(255, 0, 0);
    QColor socket_select_bkcolor = QColor(255, 150, 150);
}

//===================================================================================================================================================
//	Конструктор класса
//===================================================================================================================================================
CfcInputSocket::CfcInputSocket(uint8_t index, CfcBasicNode* node, QGraphicsItem* parent)
    : CfcSocket(index, node, parent)
{
}


//===================================================================================================================================================
//	Открытые методы класса
//===================================================================================================================================================
QDomNode CfcInputSocket::toXML() const
{
    QDomDocument xml;
    QDomElement xml_socket = xml.createElement("connector");
    xml_socket.setAttribute("id", id());
    xml_socket.setAttribute("type", "Input");

    return xml_socket;
}


//===================================================================================================================================================
//	Перегружаемые методы класса
//===================================================================================================================================================
void CfcInputSocket::paint(QPainter* painter, const QStyleOptionGraphicsItem* option, QWidget* widget)
{
    int radius = socket_radius + shape_width / 2;
    QPen pen = QPen(shape_color, shape_width);
    QBrush brush = QBrush(input_bkcolor);
    if (highLight()) {
        radius = 2 * socket_radius;
        pen = QPen(socket_select_color, 0);
        brush = QBrush(socket_select_bkcolor);
    }
    painter->setPen(pen);
    painter->setBrush(brush);

    painter->drawRect(boundingRect().center().x() - radius, boundingRect().center().y() - radius, 2 * radius, 2 * radius);

    return;
}
