#ifndef __CFC_SCENE_H__
#define __CFC_SCENE_H__


//===================================================================================================================================================
//	Подключение библиотек QT
//===================================================================================================================================================
#include <QObject>
#include <QString>
#include <QGraphicsSceneDragDropEvent>
#include <QGraphicsSceneMouseEvent>
#include <QGraphicsSceneContextMenuEvent>
#include <QAction>

//===================================================================================================================================================
//	Подключение модулей проекта
//===================================================================================================================================================
#include "cfc_basic_scene.h"
#include "gui/forms/algorithms/custom/cfc_editor/cfc_new_link.h"


//===================================================================================================================================================
//	Описание класса
//===================================================================================================================================================
//	Класс грвфической сцены
//  Методы работы с графикой и с сигналами управления
//  id - id алгоритма гибкой логики
//===================================================================================================================================================
class CfcScene : public CfcBasicScene
{
    Q_OBJECT

public:
    //===============================================================================================================================================
    //	Конструктор класса
    //===============================================================================================================================================
    CfcScene(uint16_t id, ServiceManager* service_manager, const QString& title = QString(), QGraphicsScene* parent = nullptr);

    //===============================================================================================================================================
    //	Открытые методы класса
    //===============================================================================================================================================
    void showItems(const QList<CfcNode*>& nodes, const QList<CfcLink*>& links);

public slots:
    //===============================================================================================================================================
    //	Методы обработки сигналов меню
    //===============================================================================================================================================
    void onActionBI();
    void onActionBO();
    void onActionParam();

protected:
    //===============================================================================================================================================
    //	Перегружаемые методы класса
    //===============================================================================================================================================
    virtual void drawBackground(QPainter* painter, const QRectF& rect) override;
    virtual void dropEvent(QGraphicsSceneDragDropEvent* event) override;
    virtual void dragEnterEvent(QGraphicsSceneDragDropEvent* event) override;
    virtual void dragMoveEvent(QGraphicsSceneDragDropEvent* event) override;
    virtual void mousePressEvent(QGraphicsSceneMouseEvent* event) override;
    virtual void mouseMoveEvent(QGraphicsSceneMouseEvent* event) override;
    virtual void mouseReleaseEvent(QGraphicsSceneMouseEvent* event) override;
    virtual void contextMenuEvent(QGraphicsSceneContextMenuEvent *event) override;

private:
    //===============================================================================================================================================
    //	Свойства класса
    //===============================================================================================================================================
    CfcNewLink* _new_link;
    QAction* _action_bi;
    QAction* _action_bo;
    QAction* _action_param;
};

#endif // __CFC_BASIC_SCENE_H__
