#ifndef __GRID_ITEM_H__
#define __GRID_ITEM_H__


//===================================================================================================================================================
//	Подключение библиотек QT
//===================================================================================================================================================
#include <QObject>
#include <QGraphicsItem>
#include <QGraphicsSceneMouseEvent>
#include <QVariant>
#include <QPointF>

//===================================================================================================================================================
//	Описание класса
//===================================================================================================================================================
//	Класс для привязки графических элементов к сетке
//===================================================================================================================================================
class GridItem : public QGraphicsItem
{
    Q_OBJECT

public:
    GridItem(QGraphicsItem* parent = nullptr);

protected:
    //===============================================================================================================================================
    //	Перегружаемые методы класса
    //===============================================================================================================================================
    virtual void mousePressEvent(QGraphicsSceneMouseEvent *event) override;
    virtual QVariant itemChange(GraphicsItemChange change, const QVariant &value) override;

private:
    //  Метод пересчета координат для привязки к виртуальной сетке
    QPointF calcGridPoint(const QPointF &point);

    //===============================================================================================================================================
    //	Свойства класса
    //===============================================================================================================================================
    QPointF _offset;            //  Смещение от левого верхнего узла сетки
};

#endif // __GRID_ITEM_H__
