#ifndef __CFC_COMPILER_H__
#define __CFC_COMPILER_H__


//===================================================================================================================================================
//	Подключение библиотек QT
//===================================================================================================================================================
#include <QObject>
#include <QString>

//===================================================================================================================================================
//	Подключение модулей проекта
//===================================================================================================================================================
#include "gui/forms/algorithms/custom/cfc_tools/cfc_parser.h"
#include "gui/forms/algorithms/custom/cfc_tools/byte_code.h"
#include "gui/forms/algorithms/custom/cfc_editor/cfc_node.h"
#include "gui/forms/algorithms/custom/cfc_editor/cfc_link.h"

//===============================================================================================================================================
//	Структуры данных класса
//===============================================================================================================================================
enum VariableType : uint8_t {
    VARIABLE_DISCRETE = 0,
    VARIABLE_ANALOG = 1,
    VARIABLE_INT32 = 2
};

struct CompileLink {
    QString socket_id;
    QStringList links_list;
    uint8_t type = 0;
    bool inversion = false;
    int pin_number = -1;
    int16_t link_number = -1;
};

struct CompileElement {
    uint8_t type = 0;               //  Тип узла
    QList<int32_t> params;          //  Список значений параметров
    QList<CompileLink> inputs;      //  Список входов
    QList<CompileLink> outputs;     //  Список выходов
};


//===================================================================================================================================================
//	Описание класса
//===================================================================================================================================================
class CfcCompiler : public QObject
{
	Q_OBJECT

public:
    //===============================================================================================================================================
	//	Конструктор и деструктор класса
	//===============================================================================================================================================
	CfcCompiler(QObject* parent = nullptr);
	~CfcCompiler();

    //	Правило пяти
    CfcCompiler(const CfcCompiler& other) = delete;
    CfcCompiler(CfcCompiler&& other) = delete;
    CfcCompiler& operator=(const CfcCompiler& other) = delete;
    CfcCompiler& operator=(CfcCompiler&& other) = delete;

	//===============================================================================================================================================
    //	Открытые методы класса
    //===============================================================================================================================================
	ByteCode* byteCode() { return _byte_code; }
    bool compile(CfcParser* parser);

private:
	//===============================================================================================================================================
	//	Вспомогательные методы класса
	//===============================================================================================================================================
    QList<CompileElement> getNodes(QList<CfcNode*> nodes);
    bool setLinks(QList<CfcLink*> links, QList<CompileElement>& nodes_list);

	//===============================================================================================================================================
	//	Методы работы с байт-кодом
	//===============================================================================================================================================
    bool createByteCode(QList<CompileElement>& nodes_list);
	void createHeader(uint32_t ramsize, QString title);
    uint32_t maxVarsSize(QList<CompileElement>& nodes_list);
    uint32_t totalConnections(QList<CompileElement>& nodes_list);
    void createNode(const CompileElement& node);
	int setNodeType(uint8_t type);
	int setNodeParams(const QList<int32_t>& params);
    int setNodeIO(const QList<CompileLink> channel, bool channel_type);
	uint32_t getCRC(ByteCode* byte_code, uint32_t init);

private slots:
    //===============================================================================================================================================
    //	Обработка сигналов парсера
    //===============================================================================================================================================
    void onParserError(const QString& message);
    void onParserInfo(const QString& message);

signals:
    //===============================================================================================================================================
    //	Сигналы компилятора
    //===============================================================================================================================================
    void errorToLog(const QString& message);
    void infoToLog(const QString& message);

private:
	//===============================================================================================================================================
	//	Свойства класса
	//===============================================================================================================================================
	ByteCode* _byte_code;
	QString _title;
};

#endif	//	__CFC_COMPILER_H__
