#ifndef __CFC_EDITOR_ITEM_H__
#define __CFC_EDITOR_ITEM_H__


//===================================================================================================================================================
//	Подключение библиотек QT
//===================================================================================================================================================
#include <QList>
#include <QIcon>
#include <QString>


//===================================================================================================================================================
//	Описание класса
//===================================================================================================================================================
//
//===================================================================================================================================================
class CfcEditorItem
{
public:
	//===============================================================================================================================================
	//	Конструктор и деструктор класса
	//===============================================================================================================================================
    CfcEditorItem(QString name, QIcon icon, QString index, CfcEditorItem* parent_item = nullptr);
    ~CfcEditorItem();

    //	Правило пяти
    CfcEditorItem(const CfcEditorItem& other) = delete;
    CfcEditorItem(CfcEditorItem&& other) = delete;
    CfcEditorItem& operator=(const CfcEditorItem& other) = delete;
    CfcEditorItem& operator=(CfcEditorItem&& other) = delete;

	//===============================================================================================================================================
	//	Методы работы со свойствами класса
	//===============================================================================================================================================
    QString name() const { return _name; }
    QString index() const { return _index; }
    QIcon icon() const { return _icon; }

	//===============================================================================================================================================
	//	Открытые методы класса
	//===============================================================================================================================================
    void appendChild(CfcEditorItem* child) { _child_items.append(child); }
    CfcEditorItem* child(int row) { return _child_items.value(row); }
    int childCount() const { return _child_items.count(); }
    int row() const { return _parent_item ? _parent_item->_child_items.indexOf(const_cast<CfcEditorItem*>(this)) : 0; }
    CfcEditorItem* parentItem() { return _parent_item; }

private:
	//===============================================================================================================================================
	//	Свойства класса
	//===============================================================================================================================================
    QList<CfcEditorItem*> _child_items;
	QString _name;
	QIcon   _icon;
	QString _index;
    CfcEditorItem* _parent_item;
};

#endif	//	__CFC_EDITOR_ITEM_H__
