#ifndef __CFC_EDITOR_MODEL_H__
#define __CFC_EDITOR_MODEL_H__


//===================================================================================================================================================
//	Подключение библиотек QT
//===================================================================================================================================================
#include <QObject>
#include <QAbstractItemModel>
#include <QModelIndex>
#include <QMimeData>
#include <QVariant>

//===================================================================================================================================================
//	Подключение модулей проекта
//===================================================================================================================================================
#include "gui/forms/algorithms/custom/cfc_tools/cfc_editor_item.h"

//===================================================================================================================================================
//	Описание класса
//===================================================================================================================================================
//===================================================================================================================================================
class CfcEditorModel : public QAbstractItemModel
{
	Q_OBJECT

public:
	//===============================================================================================================================================
	//	Конструктор и деструктор класса
	//===============================================================================================================================================
    CfcEditorModel(QObject* parent = 0);
    ~CfcEditorModel();

    //	Правило пяти
    CfcEditorModel(const CfcEditorModel& other) = delete;
    CfcEditorModel(CfcEditorModel&& other) = delete;
    CfcEditorModel& operator=(const CfcEditorModel& other) = delete;
    CfcEditorModel& operator=(CfcEditorModel&& other) = delete;

    //===============================================================================================================================================
    //	Перегружаемые методы класса
    //===============================================================================================================================================
    int rowCount(const QModelIndex& parent = QModelIndex()) const override;
    int columnCount(const QModelIndex& parent = QModelIndex()) const override;
    Qt::ItemFlags flags(const QModelIndex& index) const override;
    QModelIndex index(int row, int column, const QModelIndex& parent = QModelIndex()) const override;
    QModelIndex parent(const QModelIndex& index) const override;
    QVariant data(const QModelIndex& index, int role) const override;
    QMimeData* mimeData(const QModelIndexList& indexes) const override;

private:
    //===============================================================================================================================================
    //	Свойства класса
    //===============================================================================================================================================
    CfcEditorItem* _root_item;
};

#endif	//	__CFC_EDITOR_MODEL_H__
