#ifndef __FLEX_EDITOR_FORM_H__
#define __FLEX_EDITOR_FORM_H__


//===================================================================================================================================================
//	Подключение сторонних библиотек
//===================================================================================================================================================
#include <dpc/gui/dialogs/msg_box/MsgBox.h>

//===================================================================================================================================================
//	Подключение библиотек QT
//===================================================================================================================================================
#include <QMainWindow>
#include <QObject>
#include <QWidget>
#include <QCloseEvent>
#include <QString>
#include <QGraphicsView>
#include <QTreeView>
#include <QModelIndex>
#include <QAction>
#include <QLineEdit>


//===================================================================================================================================================
//	Подключение модулей проекта
//===================================================================================================================================================
#include "gui/forms/algorithms/custom/cfc_editor/cfc_scene.h"
#include "gui/forms/algorithms/custom/cfc_editor/cfc_view.h"

//===================================================================================================================================================
//	Описание класса
//===================================================================================================================================================
class FlexEditorForm : public QMainWindow
{
	Q_OBJECT

public:
	//===============================================================================================================================================
	//	Конструктор и деструктор класса
	//===============================================================================================================================================
    FlexEditorForm(DcController* device, CfcAlgService* cfcAlg, QWidget* parent = 0);
    ~FlexEditorForm();

    //	Правило пяти
    FlexEditorForm(const FlexEditorForm& other) = delete;
    FlexEditorForm(FlexEditorForm&& other) = delete;
    FlexEditorForm& operator=(const FlexEditorForm& other) = delete;
    FlexEditorForm& operator=(FlexEditorForm&& other) = delete;

	//===============================================================================================================================================
	//	Открытые методы класса
	//===============================================================================================================================================
    CfcView* graphView() const { return _graph_view; }
    CfcScene* scene() { return _scene; }
    CfcAlgService* cfcAlg() const { return _cfcAlg; }
	bool hasError() const { return _hasError; }
    QString errorString() const { return _errorString; }

private:
	//===============================================================================================================================================
	//	Вспомогательные методы класса
	//===============================================================================================================================================
    void zoomChange(int flag);
    void createTreeView();
    void createToolbar();

private slots:
	//===============================================================================================================================================
	//	Методы обработки сигналов формы
	//===============================================================================================================================================
	void onSaveAction();
    void buttonsChange();
    void treeClicked(const QModelIndex& index);
    void setGridEnable(bool enable);
    void zoomInClicked() { zoomChange(-1); }
    void zoomOutClicked() { zoomChange(1); }
    void zoomDefaultClicked() { zoomChange(0); }
    void addInputs();
    void removeInputs();

protected:
	//===============================================================================================================================================
	//	Перегружаемые методы класса
	//===============================================================================================================================================
    virtual void closeEvent(QCloseEvent* event) override;
	virtual void keyPressEvent(QKeyEvent* event) override;
	virtual void wheelEvent(QWheelEvent* event) override;

signals:
	//===============================================================================================================================================
	//	Сигналы изменения формы
	//===============================================================================================================================================
	void aboutToClose();

private:
	//===============================================================================================================================================
	//	Элементы формы
	//===============================================================================================================================================
    CfcView* _graph_view;
    CfcScene* _scene;
    QTreeView* _tree_menu;
    QLineEdit* _zoom_edit;
    QAction* _grid_action;
    QAction* _copy_action;
    QAction* _cut_action;
    QAction* _paste_action;
    QAction* _delete_action;
    QAction* _append_connector_action;
    QAction* _remove_connector_action;

    CfcAlgService* _cfcAlg;
	bool _hasError;
    QString _errorString;
	float _scale_factor;
};

#endif // __FLEX_EDITOR_FORM_H__
