#ifndef __VIRTUAL_FUNCTIONS_MODEL_H__
#define __VIRTUAL_FUNCTIONS_MODEL_H__


//===================================================================================================================================================
//	Подключение библиотек QT
//===================================================================================================================================================
#include <QObject>
#include <QAbstractTableModel>
#include <QModelIndex>
#include <QVariant>

//===================================================================================================================================================
//	Подключение модулей проекта
//===================================================================================================================================================


//===================================================================================================================================================
//	Описание класса
//===================================================================================================================================================
//	Модель для вывода списка виртуальных функций
//===================================================================================================================================================

class FuncService;

class VirtualFunctionsModel : public QAbstractTableModel
{
    Q_OBJECT

public:
    enum Columns
    {
        NUMBER_COLUMN = 0,
        OUTPUT_COLUMN,
        FUNCTION_COLUMN,
        PARAMETER_COLUMN,

        TOTAL_COLUMNS
    };

    //===============================================================================================================================================
    //	Конструктор класса
    //===============================================================================================================================================
    VirtualFunctionsModel(FuncService *service, QObject* parent = nullptr);

    //===============================================================================================================================================
    //	Перегружаемые методы класса
    //===============================================================================================================================================
    virtual int rowCount(const QModelIndex& parent = QModelIndex()) const override;
    virtual int columnCount(const QModelIndex& parent = QModelIndex()) const override;
    virtual QVariant headerData(int section, Qt::Orientation orientation, int role = Qt::DisplayRole) const override;
    virtual Qt::ItemFlags flags(const QModelIndex& index) const override;
    virtual QVariant data(const QModelIndex& index, int role = Qt::DisplayRole) const override;
    virtual bool setData(const QModelIndex& index, const QVariant& value, int role = Qt::EditRole) override;

private:
    //===============================================================================================================================================
    //  Вспомогательные методы класса
    //===============================================================================================================================================
    FuncService* service() const { return _service; }

    //===============================================================================================================================================
    //	Свойства класса
    //===============================================================================================================================================
    FuncService* _service;
};

#endif // __VIRTUAL_FUNCTIONS_MODEL_H__
