#ifndef __DEP_USER_ROLES_H__
#define __DEP_USER_ROLES_H__

//===================================================================================================================================================
//	Подключение стандартных библиотек
//===================================================================================================================================================
#include <cstdint>

//===================================================================================================================================================
//	Списки данных проекта
//===================================================================================================================================================
enum DepUserRoles : uint8_t {								//	Список типов пользователей оборудования
	NO_ROLE = 0,											//	Пользователь не авторизован
	USER_ROLE,												//	Авторизован обычный пользователь
	ADMIN_ROLE,												//	Авторизован администратор
	SUPERUSER_ROLE											//	Авторизован разработчик
};



#endif	//	__DEP_USER_ROLES_H__
