#ifndef __ERROR_CODES_H__
#define __ERROR_CODES_H__

//===================================================================================================================================================
//	Списки данных проекта
//===================================================================================================================================================
enum ReturnTypes : int {									//	Результаты выполнения пргорамм
	RETURN_DATA = 1,										//	Успешное окончание программы
	RETURN_NONE = 0,                                     	//	Выход из программы без выполнения
	RETURN_FATAL = -1,										//	Фатальная ошибка выполнения программы
	RETURN_ERROR = -2,										//	Ошибка выполнения программы
	RETURN_WARNING = -3,									//	Выход из программы с предупреждением
	RETURN_NOTE = -4,										//	Выход из программы с сообщением
	RETURN_EXIT = -100										//	Выход из основной программы
};

#endif	//	__ERROR_CODES_H__
